#include <stdio.h>

int main(){
    int a =0x1234;
    int* p; //int *p,q,r 이렇게 쓰면 p만 포인터이고 q,r은 일반형인줄 아는 착각이 발생할 수 있다

    p=&a;
    * p = 0x1111;
    *(p+1)= 0x2222;
    *(p+2)= 0x3333;
    *(p+3)= 0x4444;
    printf("포인터\t*포인터\t&포인터\n");
    printf("p:%08x\t%08x\t%08x\n",p,* p,&p); 
    printf("p+1:%08x\t%08x\t%08x\n",p+1,*(p+1),&p+1); //p가 가르키는 주소의 안에 있는 값
    printf("p+2:%08x\t%08x\t%08x\n",p+2,*(p+2),&p+2); //p가 가르키는 주소의 안에 있는 값
    printf("p+3:%08x\t%08x\t%08x\n",p+3,*(p+3),&p+3); //p가 가르키는 주소의 안에 있는 값
    //포인터(p) = 데이터의 주소를 저장, 포인터가 가르키는 곳의 값(*p),  포인터의 주소(&p)
    //p+1 >> p가 int로 선언되었기 때문에 4byte 씩 늘어남. 즉 옆집으로 생각하면 됨
    //&p+1 >> 64bit 에서 포인터의 크기는 8byte이기 때문에 8byte씩 늘어남. 다음 주소책 정도로 생각하면 됨.

}